           FD  Empleados-archivo.
           01  empleados-registro.
               05  empleados-id PIC 9(6).
               05  empleados-nombre PIC X(25).
               05 empleados-apellidos PIC X(35).
               05 empleados-edad PIC X(3).
               05 empleados-telefono PIC X(9).
               05 empleados-direccion PIC X(35).
